#!/usr/bin/python3.8
# -*- coding: UTF-8 -*-
# -*- coding: UTF-8 -*-

#=======================================first Method========================================
#赋值给a和b
# a=1
# b=2
# x='计算结果为:'
# result=a+b
# print('计算',a,'+',b,'的结果')
# print(x,result)
#打印结果，暂时没想到更好的解决办法

#=======================================first Method========================================


#=======================================Second Method========================================

#a、b赋值
a=1
b=2
x='计算结果为:'
y= '计算'+str(a)+'+'+str(b)+'的结果''\n'     #拼接“1+2的结果及换行”
result=y+x+str(a+b)                        #result赋值
#result=a+b #旧方法
#print(y+x + str(result)) #旧方法
print(result)

#=======================================Second Method========================================