#!/usr/bin/python3.8
# -*- coding: UTF-8 -*-
# -*- coding: UTF-8 -*-

#=======================================first Method========================================
#赋值给a和b
# a=1
# b=2
# x='计算结果为:'
# result=a+b
# print('计算',a,'+',b,'的结果')
# print(x,result)
#打印结果，暂时没想到更好的解决办法

#=======================================first Method========================================


#=======================================Second Method========================================
a=1
b=2
x='计算结果为:'
result=a+b
#print('计算',a,'+',b,'的结果')

y= '计算'+str(a)+'+'+str(b)+'的结果''\n'
print(y+x + str(result))

#=======================================Second Method========================================